Repository: GICodeWarrior/mediawiki-extensions
Catalog: tools/alertbot/locale/*/LC_MESSAGES/webinterface.po
Languages: de_de

source: Wikipedia emergency problem report
de_de: Wikimedias Notfall-Problemmelder

source: Is your problem related to a Wikimedia project being unreachable or broken?<br />If not, please think of filing a bug at <a href="http://bugzilla.wikimedia.org">Bugzilla</a> instead.
de_de: Besteht das Problem in der Nichterreichbarkeit eines Wikimedia-Projekts?

source: Have you understood this script is <em>only</em> for emergencies?
de_de: Dieses Skript dient nur fuer Notfaelle

source: <strong>Is your problem listed on the list at the page end?</strong>
de_de: Ist das Problem unten bereits aufgelistet?

source: On which project did you encounter the problem?
de_de: Wo haben Sie das Problem bemerkt?

source: What language version of the project is it?<br />Please fill in the language code (de, en, etc.)
de_de: Welche Sprachversion ist es?<br />Bitte fuellen Sie die Sprache aus

source: What is your problem? Choose:
de_de: Worum handelt es sich bei Ihrem Problem? Bitte waehlen:

source: Who is affected?
de_de: Wen betrifft das Problem?

source: Submit your problem report:
de_de: Problembericht abschicken:

source: Submit problem
de_de: OK

source: Your IP address will be recorded to prevent abuse.
de_de: Ihre IP-Addresse wird zur Vermeidung von Missbrauch aufgezeichnet.

source: Current problems
de_de: Momentan bekannte Probleme:
