Repository: GICodeWarrior/mediawiki-extensions
Catalog: fundcore/modules/i18n/po/*.po
Languages: de

source: <p>This module provides support for internationalization of Drupal sites in various ways:</p> <ul><li>Translation of the user interface for registered and anonymous users</li> <li>Multi-language for content, combined with url aliasing. For this feature to be used, you must enable it in the module configuration and then use url aliasing to keep pages in various languages. I.e. 'en/mypage', 'es/mypage' should be English and Spanish versions of the same page</li> <li>Detection of the brower language</li> <li>Keeps the language settings accross consecutive requests, using a number of methods: URL rewriting, sessions, cookies</li> <li>Provides a block for language selection and two theme functions: <i>i18n_flags</i> and <i>i18n_links</i></li></ul> <p>For url rewriting you need to have the file <b>i18n.inc</b> in the <i>includes</i> folder and add the following line to your configuration file:</p> <pre> include 'includes/i18n.inc'; </pre> <p>You can try different settings to have only content translation, interface translation or both.</p> <p><small>Module developed by <a href="http://freelance.reyero.net">freelance.reyero.net</a></small></p>
de: <p>Diese Modul erm&ouml;glicht die Internationalisierung von Drupal Seiten auf verschiedene Arten:</p> <ul><li>&Uuml;bersetzung des Benutzer-Interface f&uuml;r registrierte und anonyme Nutzer</li> <li>Diverse &Uuml;bersetzungen f&uuml;r den Inhalt, kombiniert mit URL aliasing. Um dieses Feature zu benutzen muss es in der Modul Konfiguration eingeschaltet werden und erm&ouml;glicht dann den Zugang zu den &Uuml;bersetzung der Seiten in verschiedenen Sprachen. Bsp: "en/mypage", "de/mypage" w&auml;re dann die gleiche Seite in Englisch und Deutsch.</li> <li>Automatische Erkennung der im Browser eingestellten Sprache</li> <li>Beh&auml;lt die eingestellte Sprache auch f&uuml;r aufeinanderfolgende Anfragen mittels verschiedener Methoden: URL rewriting, Sessions, Cookies</li> <li>Bietet einen Block f&uuml;r die Auswahl der Sprache und zwei Theme-Funktionen: <i>i18n_flags</i> und <i>i18n_links</i></li></ul> <p>F&uuml;r das URL rewriting muss die Datei <b>i18n.inc</b> im <i>includes</i> Verzeichnis liegen und die folgende Zeile muss zur Konfigurationsdatei hinzugef&uuml;gt werden:</p> <pre> include 'includes/i18n.inc'; </pre> <p>Es gibt unterschiedliche Einstellungen um nur den Inhalt, das Interface oder beides zu &uuml;bersetzen.</p> <p><small>Das Modul wurde von <a href="http://freelance.reyero.net">freelance.reyero.net</a> entwickelt</small></p>

source: Supports site internationalization (i18n).
de: Erm&ouml;glicht die Internationalisierung der Seite (i18n).

source: edit %language
de: Bearbeite %language

source: Interface translation
de: Interface-&Uuml;bersetzung

source: Disabled
de: Ausgeschaltet

source: Enabled
de: Eingeschaltet

source: If disabled, uses Drupal's default. If enabled, translates the interface to selected language
de: Falls ausgeschaltet wird die Standard-Einstellung benutzt. Falls eingeschaltet wird das Interface in die ausgew&auml;hlte Sprache &uuml;bersetzt

source: Content translation
de: &Uuml;bersetzung des Inhalts

source: If enabled, prepends language code to url and searches for translated content
de: Falls eingeschaltet wird der Sprachcode der URL vorangestellt und nach dem &uuml;bersetzten Inhalt gesucht

source: Synchronize content
de: Synchronisiere den Inhalt

source: Taxonomy
de: Taxonomie

source: Synchronize tables for different languages. When some element is created/removed, it will be created/removed for all languages with the same id
de: Synchronisiere die Tabellen f&uuml; verschiedene Sprachen. Wenn ein Element angelegt/gel&ouml;scht wird, wird es f&uuml;r alle Sprachen mit der gleichen id angelegt/gel&ouml;scht

source: Front page
de: Startseite

source: Default
de: Standard

source: Language dependant
de: Sprachabh&auml;ngig

source: If language dependant and <i>Content translation</i> is enabled, default front page will be prepended with language code, i.e. 'en/node'
de: Falls sprachabh&auml;ngig und <i>Inhalts&uuml;bersetzung</i> eingeschaltet, wird der Startseite der Sprachcode vorangestellt, bsp: 'de/node'

source: Keep Language
de: Behalte die Sprache

source: A language code independent of user's language will be kept accross requests using the selected method
de: Ein von der Sprache des Benutzers unabh&auml;ngiger Sprachcode wird &uuml;ber alle Anfragen hinweg mittels der ausgew&auml;hlten Methode gespeichert

source: Detect browser language
de: Erkenne die im Browser eingestellte Sprache

source: Flags directory
de: Verzeichnis, das die Fahnen enth&auml;lt

source: Path for flags. Asterisk '*' is a placeholder for language code. This is only needed when you want a language selector block
de: Pfad zu den Fahnen. '*' ist ein Platzhalter f&uuml;r den Sprachcode. Dies wird nur ben&ouml;tigt, wenn ein Sprachauswahlblock angezeigt werden soll

source: Languages
de: Sprachen
