Repository: GICodeWarrior/mediawiki-extensions
Catalog: debs/squid/debian/po/*.po
Languages: de, ja, nl, sv

source: The http_anonymizer directive has been replaced with header_replace and header_access.
de: Die Direktive http_anonymizer wurde durch header_replace und header_access ersetzt.
ja: http_anonymizer ディレクティブは header_replace と header_access で置き換えられました。
nl: De http_anonymizer-richtlijn is vervangen door header_replace en header_access.
sv: http_anonymizer har blivit utbytt mot header_replace och header_access.

source: The http_anonymizer directive that was present in squid 2.1 and 2.2 doesn't exist anymore in squid 2.3 and up. It has been replaced with header_replace and header_access that provide more fine-grained control over HTTP headers. Right now, your squid doesn't anonymize the HTTP headers anymore so you probably want to fix this. The new format is explained in the new 2.5 config file, of which you probably have a copy in /usr/share/doc/squid/examples/squid.conf.
de: Die http_anonymizer-Direktive aus den Squid-Versionen 2.1 und 2.2 existiert in den Squid-Versionen 2.3 und höher nicht mehr. Sie wurde durch header_replace und header_access ersetzt, die eine feinere Kontrolle über HTTP-Header erlauben. Im Moment anonymisiert Ihr Squid die HTTP-Header nicht mehr, so dass Sie diese Sache wahrscheinlich beheben wollen. Das neue Format wird in der neuen 2.5er-Konfigurationsdatei in /usr/share/doc/squid/examples/squid.conf erklärt.
ja: squid 2.1 および 2.2 で提供されていた http_anonymizer ディレクティブは、squid 2.3 以降ではもう存在しません。これは、HTTP ヘッダのより高い粒度の制御を提供する header_replace と header_access で置き換えられています。今のところ、あなたの squid は HTTP ヘッダを匿名化していないので、おそらくこれを修正したいでしょう。新しいフォーマットは、おそらく /usr/share/doc/squid/examples/squid.conf にコピーがある新しい 2.5 設定ファイルで解釈されます。
nl: De http_anonymizer-richtlijn die aanwezig was in squid 2.1 en 2.2 bestaat niet meer in squid 2.3 en latere versies. Deze richtlijn is vervangen door header_replace en header_access die een preciezere controle toelaten over HTTP-headers. Op dit moment maakt squid uw gebruikers niet anoniem, u wil dit waarschijnlijk repareren. Het nieuwe formaat wordt uitgelegd in het nieuwe squid 2.5 configuratiebestand, waarvan u waarschijnlijk een kopie heeft in /usr/share/doc/squid/examples/squid.conf.
sv: http_anonymizer som fanns i squid 2.1 och 2.2 finns inte längre i squid 2.3 och uppåt. Den har blivit utbytt mot header_replace och header_access som ger en bättre kontroll av HTTP headers. Just nu använder din squid cache inte anonyma HTTP headers så du kanske vill åtgärda detta. Det nya formatet förklaras i den nya 2.5 konfigurationsfilen som du antagligen har en kopia av i /usr/share/doc/squid/examples/squid.conf.

source: The anonymize_headers and fake_user_agent directives have been replaced with header_access and header_replace.
de: Die Direktiven anonymize_headers und fake_user_agent wurden durch header_access und header_replace ersetzt.
ja: anonymize_headers と fake_user_agent ディレクティブは header_access と header_replace で置き換えられました。
nl: De anonymize_headers- en fake_user_agent-richtlijnen zijn vervangen door header_access en header_replace
sv: anonymize_headers och fake_user_agent har blivit utbytta med header_access och header_replace.

source: The anonymize_headers and fake_user_agent directives that were present in squid 2.3 and 2.4 don't exist anymore in squid 2.5 and up. They have been replaced with header_replace and header_access that provide more fine-grained control over HTTP headers. Right now, your squid doesn't anonymize the HTTP headers anymore so you probably want to fix this. The new format is explained in the new 2.5 config file, of which you probably have a copy in /usr/share/doc/squid/examples/squid.conf.
de: Die Direktiven anonymize_headers und fake_user_agent aus den Squid-Versionen 2.3 und 2.4 existieren in den Squid-Versionen 2.5 und höher nicht mehr. Sie wurden durch header_replace und header_access ersetzt, die eine feinere Kontrolle über HTTP-Header erlauben. Im Moment anonymisiert Ihr Squid die HTTP-Header nicht mehr, so dass Sie diese Sache wahrscheinlich beheben wollen. Das neue Format wird in der neuen 2.5er-Konfigurationsdatei erklärt, von der Sie unter /usr/share/doc/squid/examples/squid.conf wahrscheinlich eine Kopie haben.
ja: squid 2.3 および 2.4 で提供されていた http_headers および fake_user_agent ディレクティブは、squid 2.5 以降ではもう存在しません。これらは、HTTP ヘッダのより高い粒度の制御を提供する header_replace と header_access で置き換えられています。今のところ、あなたの squid は HTTP ヘッダを匿名化していないので、おそらくこれを修正したいでしょう。新しいフォーマットは、おそらく /usr/share/doc/squid/examples/squid.conf にコピーがある新しい 2.5 設定ファイルで解釈されます。
nl: De anonymize_headers- en fake_user_agent-richtlijnen die aanwezig waren in squid 2.3 en 2.4 bestaan niet meer in squid 2.5 en latere versies. Ze zijn vervangen door header_replace en header_access die een preciezere controle toelaten over HTTP-headers. Op dit moment maakt squid uw gebruikers niet meer anoniem, u wil dit waarschijnlijk repareren. Het nieuwe formaat wordt uitgelegd in het nieuwe squid 2.5 configuratiebestand, waarvan u waarschijnlijk een kopie heeft in /usr/share/doc/squid/examples/squid.conf.
sv: anonymize_headers och fake_user_agent som tidigare fanns i squid 2.3 och 2.4 finns inte längre i squid 2.5 och uppåt. De har nu blivit utbytta mot header_replace och header_access som ger en bättre kontroll över HTTP headers. Just nu använder din squid inte anonyma HTTP headers så du kanske vill rätta till detta. Det nya formatet är förklarat i den nya 2.5 konfigurationsfilen som du säkerligen har en kopia av i /usr/share/doc/squid/examples/squid.conf.

source: There is no automatic upgrade path to squid 2.5.
de: Eine automatische Aktualisierung auf Squid 2.5 ist unmöglich.
ja: squid 2.5 への自動更新の手段がありません。
nl: Er is geen automatisch opwaarderingspad voor squid 2.5.
sv: Det finns ingen automatisk uppgradering till squid 2.5.

source: SQUID 2.5 INSTALLATION WARNING
de: SQUID 2.5 INSTALLATIONS-WARNUNG
ja: Squid 2.5 インストールの警告
nl: SQUID 2.5 INSTALLATIE WAARSCHUWING
sv: SQUID 2.5 INSTALLATIONSVARNING

source: You are upgrading squid from an 1.x version to the 2.5 version. The 1.x and 2.5 versions are NOT compatible. The structure of the cache directory is different and the configuration file "squid.conf" is not entirely compatible.
de: Sie wollen von einer 1.x Version auf Squid 2.5 aktualisieren. Diese Versionen sind zueinander inkompatibel. Die Struktur des Cache-Verzeichnisses ist verschieden; ebenfalls ist die Konfigurationsdatei »squid.conf« nicht vollständig kompatibel.
ja: squid を 1.x バージョンから 2.5 バージョンに更新しようとしています。1.x と 2.5 バジョンは互換性が*ありません*。キャッシュディレクトリの構造が異なり、設定ファイル "squid.conf" はまったく非互換です。
nl: U bent squid aan het opwaarderen van een 1.x versie naar de 2.5 versie. De 1.x en 2.5 versies zijn NIET compatibel. De structuur van de buffer map is verschillend en het configuratiebestand "squid.conf" is niet helemaal compatibel.
sv: Du uppgraderar squid från en 1.x version till version 2.5. 1.x och 2.5 är INTE kompatibla. Strukturen av cachen är annorlunda och konfigurationsfilen "squid.conf" är inte direkt kompatibel.

source: If you have an old cache directory, please quit NOW and remove the old cache by hand (in /var/spool/squid). Then re-install this squid version.
de: Wenn Sie ein altes Cache-Verzeichnis haben, dann beenden Sie die Installation jetzt bitte und entfernen dieses Verzeichnis von Hand (in /var/spool/squid). Anschließend installieren Sie diese Squid-Version neu.
ja: 古いキャッシュディレクトリがあるのであれば、「今すぐ」中止し、(/var/spool/squid 内の) 古いキャッシュを手動で削除してください。それからこの squild バージョンを再インストールしてください。
nl: Als u nog een oude buffermap heeft, gelieve dan NU te stoppen en de oude buffer handmatig te verwijderen (/var/spool/squid). Herinstalleer daarna deze versie van squid.
sv: Om du har en gammal cache mapp, vänligen avsluta NU och radera den gamla cachen manuellt (i /var/spool/squid). Installera sedan om denna version av squid.

source: Also, please accept the new configuration file. After upgrading your old configuration file can be found in "/etc/squid.conf.dpkg-old". Then you have to edit the new configuration file by hand to match your old configuration.
de: Achten Sie auch auf die neue Konfigurationsdatei. Nach der Installation finden Sie die alte Version der Konfiguration unter »/etc/squid.conf.dpkg-old«. Passen Sie die neue Konfigurationsdatei dann entsprechend Ihrer Bedürfnisse von Hand an.
ja: さらに、新しい設定ファイルを受け入れてください。更新後、あなたの古い設定ファイルは "/etc/squid.conf.dpkg-old" として見つけられます。それから新しい設定ファイルを古い設定ファイルと適合するよう手動で編集する必要があります。
nl: Gelieve het nieuwe configuratiebestand te aanvaarden. Na het opwaarderen kan u uw oude configuratie bestand vinden in "/etc/squid.conf.dpkg-old". Dan kan u het nieuwe configuratiebestand handmatig veranderen om uw oude configuratie terug te krijgen.
sv: Kom i håg att efter uppgradering måste du ändra den nya konfigurationsfilen manuellt. Den gamla konfigurationen hittar du här "/etc/squid.conf.dpkg-old".

source: Do you want to quit now?
de: Installation beenden?
ja: 今すぐ中止しますか?
nl: Wilt u nu stoppen?
sv: Vill du verkligen avsluta nu?

source: squid-cgi now uses config file for target ACL
de: squid-cgi benutzt nun eine Konfigurationsdatei als Zugangskontrollliste (»Access Control List«) für Zielhosts
ja: squid-cgi は現在、ACL のターゲットに設定ファイルを使います。
nl: squid-cgi gebruikt nu een configuratiebestand voor doel-ACL
sv: squid-cgi använder nu konfigurationsfilen för target ACL

source: squid-cgi now checks a configuration file before connecting to the target host. Only allowed target will be contacted. Please add hosts you want to access to the file /etc/squid/cachemgr.conf, one per line in the form
de: squid-cgi liest nun eine Konfigurationsdatei, bevor eine Verbindung zum Ziel-Host aufgebaut wird. Nur zu erlaubten Hosts wird eine Verbindung hergestellt. Bitte führen Sie die Hosts, zu denen Sie eine Verbindung aufbauen wollen, in der Datei /etc/squid/cachemgr.conf auf. Jeweils einen pro Zeile in der Form
ja: squid-cgi は現在、ターゲットホストに接続する前に設定ファイルをチェックします。許可されたターゲットのみに接続されます。アクセスしたいホストを /etc/squid/cachemgr.conf ファイルに、1 行ごとに次の形式で追加してください。
nl: squid-cgi controleert nu een configuratiebestand alvorens een verbinding op te zetten met de doelcomputer. Enkel toegestane doelen zullen worden gecontacteerd. Voeg computers waarmee u wilt contact leggen toe aan het bestand /etc/squid/cachemgr.conf, één per lijn in de vorm
sv: squid-cgi kontrollerar nu konfigurationsfilen före uppkoppling mot målet. Endast tillåtna mål kommer att kontaktas. Lägg till mål du vill kontakta i filen /etc/squid/cachemgr.conf, en per linje

source: hostname:port
ja: ホスト名:ポート
nl: computernaam:poort
sv: värdnamn:port

source: Upgrade squid.conf automatically?
de: squid.conf automatisch aktualisieren?
ja: squid.conf を自動的に更新しますか?
nl: squid.conf automatisch opwaarderen?
sv: Uppgradera squid.conf automatiskt?

source: Incompatible settings have been found in the existing squid.conf file; they will prevent squid from starting or working correctly. However, this setup can try to modify them to work again. Do you want to apply the changes?
de: In Ihrer existierenden squid.conf wurden inkompatible Einstellungen gefunden. Sie führen dazu, dass squid nicht starten bzw. nicht korrekt funktionieren wird. Diese Einrichtung kann jedoch dafür sorgen die Einstellungen so zu verändern, dass sie wieder funktionieren. Sollen diese Änderungen durchgeführt werden?
ja: 非互換の設定が既存の squid.conf ファイルに見つかりました。これらは squid が正しく起動あるいは動作するのを妨げます。しかし、このセットアップは再び動作するよう変更を試行できます。変更を適用しますか?
nl: Er zijn incompatibele instellingen gevonden in het squid.conf-bestand; ze zullen squid verhinderen te starten of correct te werken. Deze setup kan ze proberen te wijzigen om opnieuw te werken. Wilt u de veranderingen toepassen?
sv: Inkompatibla inställningar har hittats i den existerande squid.conf filen. De förhindrar att squid starta eller fungerar korrekt. Det är möjligt att försöka att modifiera dem att fungera igen. Vill du göra ändringarna?

source: The authenticate_program directive has been replaced with auth_param.
de: Die Direktive authenticate_program wurde durch auth_param ersetzt.
ja: authenticate_program ディレクティブは auth_param に置き換えられました。
nl: De authenticate_program-instelling is vervangen door auth_param.
sv: authenticate_program har blivit utbytt mot auth_param.

source: The authenticate_program directive that was present in squid <= 2.4 doesn't exist anymore in squid 2.5 and up. All authentication directives have been replaced with auth_param. Right now, your squid doesn't authenticate users anymore so you probably want to fix this. The new format is explained in the new 2.5 config file, of which you probably have a copy in /usr/share/doc/squid/examples/squid.conf.
de: Die authenticate_program-Direktive aus den Squid-Versionen <= 2.4 existiert in den Squid-Versionen 2.5 und höher nicht mehr. Sie wurde durch auth_param ersetzt. Im Moment authentifiziert Ihr Squid Benutzer nicht mehr, so dass Sie diese Sache wahrscheinlich beheben wollen. Das neue Format wird in der neuen 2.5er-Konfigurationsdatei in /usr/share/doc/squid/examples/squid.conf erklärt.
ja: squid 2.4 以前で提供されていた authenticate_program ディレクティブは、squid 2.5 以降ではもう存在しません。すべての認証ディレクティブは auth_param で置き換えられています。今のところ、あなたの squid は ユーザを認証していないので、おそらくこれを修正したいでしょう。新しいフォーマットは、おそらく /usr/share/doc/squid/examples/squid.conf にコピーがある新しい 2.5 設定ファイルで解釈されます。
nl: De authenticate_program-richtlijn die aanwezig was in squid <= 2.4 bestaat niet meer in squid 2.5 en latere versies. Alle authenticatierichtlijnen zijn vervangen door auth_param. Op dit moment authenticeert uw squid geen gebruikers meer, u wil dit waarschijnlijk repareren. Het nieuwe formaat wordt uitgelegd in het nieuwe squid 2.5 configuratiebestand, waarvan u waarschijnlijk een kopie heeft in /usr/share/doc/squid/examples/squid.conf.
sv: authenticate_program som fanns i squid <= 2.4 finns inte längre i squid 2.5 och uppåt. Alla authentication funktioner har blivit utbytta med auth_param. Just nu authentiserar inte din squid dina användare så du vill antagligen fixa detta. Det nya formatet är förklarat i den nya 2.5 konfigurationsfilen som du antagligen har en kopia av i /usr/share/doc/squid/examples/squid.conf.

source: Warning: squid may crash when logfiles size is bigger than 2GB.
de: Warnung: squid kann abstürzen, wenn Log-Dateien größer als 2GB sind.
ja: 警告: squid はログファイルサイズが 2GB を超えたときにクラッシュする恐れがあります。
nl: Waarschuwing: squid kan vastlopen wanneer de grootte van een logbestand meer is dan 2GB.
sv: Varning: squid kan krascha när storleken på logfilen blir större än 2GB.

source: Squid may crash if any of the logfiles grows bigger than 2GB. Please configure /etc/logrotate.d/squid accordingly to your site's traffic.
de: Squid kann abstürzen, wenn eine seiner Log-Dateien größer als 2GB wird. Bitte konfigurieren Sie /etc/logrotate.d/squid entsprechend dem Netzwerk-Traffic Ihrer Site.
ja: squid はログファイルが 2GB を超えてしまったときにクラッシュする恐れがあります。あなたのサイトのトラフィックに応じて、/etc/logrotate.d/squid を設定してください。
nl: Squid kan vastlopen als één van de logbestanden groter wordt dan 2GB. Configureer /etc/logrotate.d/squid aangepast aan het verkeer op uw site.
sv: Squid kan krascha om någon av logfilerna växer sig större än 2GB. Konfigurera /etc/logrotate.d/squid enligt dina önskemål.

source: Fix permissions of cache_dir?
de: Berechtigungen für cache_dir beheben?
ja: cache_dir のパーミッションを修正しますか?
nl: Permissies van cache_dir repareren?
sv: Fixa rättigheter på cache_dir?

source: Values for cache_effective_user and/or cache_effective_group in config file are incompatible with owner/group of cache directories. Do you want to automatically fix permissions on cache directory?
de: Werte für cache_effective_user und/oder cache_effective_group in der Konfigurationsdatei sind inkompatibel mit dem Eigentümer bzw. der Gruppe des Cache-Verzeichnisses. Sollen die Berechtigungen des Cache-Verzeichnisses automatisch behoben werden?
ja: 設定ファイルの cache_effective_user および cache_effective_group の値が、キャッシュディレクトリのオーナ/グループと異なっています。自動的にキャッシュディレクトリのパーミッションを修正しますか?
nl: De waarden voor cache_effective_user en/of cache_effective_group in het configuratiebestand zijn incompatibel met de gebruiker/groep van cache-mappen. Wilt u de permissies van de cache-map automatisch laten repareren?
sv: Värden för cache_effective_user och/eller cache_effective_group i konfigurationsfilen är inkompatibla med ägare/grupp av cache mapparna. Vill du automatiskt fixa rättigheterna på cache mappen?

source: WARNING: If you specified a cache directory different from /var/spool/squid and selected some other directory used by other programs (e.g. /tmp), this could affect those programs.
de: WARNUNG: Wenn Sie ein Cache-Verzeichnis verschieden von /var/spool/squid angegeben haben und dieses Verzeichnis (z.B. /tmp) von anderen Programmen benutzt wird, dann könnte sich das auf diese Programme auswirken.
ja: 警告: キャッシュディレクトリに /var/spool/squid ではなく、ほかのプログラムによって使われるその他のディレクトリ (/tmp など) を選択しているときには、それらのプログラムに悪影響を及ぼす可能性があります。
nl: WAARSCHUWING: als u een cache-map opgaf verschillend van /var/spool/squid en u selecteerde een andere map die gebruikt wordt door andere programma's (v.b. /tmp), dan kan dit deze programma's beïnvloeden.
sv: VARNING: Om du har specificerat en mapp för cache som inte är /var/spool/squid och valt en annan mapp som används av ett annat program (exempel /tmp), kan detta påverka dessa program.
