Repository: GICodeWarrior/mediawiki-extensions
Catalog: debs/squid/po/*.po
Languages: it, vi

source: The http_anonymizer directive has been replaced with header_replace and header_access.
vi: Chị thị «http_anonymizer» đã được thay thế bằng «header_replace» và «header_access».

source: The http_anonymizer directive that was present in squid 2.1 and 2.2 doesn't exist anymore in squid 2.3 and up. It has been replaced with header_replace and header_access that provide more fine-grained control over HTTP headers. Right now, your squid doesn't anonymize the HTTP headers anymore so you probably want to fix this. The new format is explained in the new 2.5 config file, of which you probably have a copy in /usr/share/doc/squid/examples/squid.conf.
it: L'opzione http_anonymizer che era presente nelle versioni 2.1 e 2.2 di squidnon esiste più nella versione 2.3 e successive. Tale opzione è stata sostituitacon le opzioni header_replace e header_access che forniscono un controllo piùgranulare sulle intestazioni HTTP.In questo momento squid non maschera più le intestazioni HTTP; è probabilequindi che vorrai correggere questo problema. Il formato delle nuoveopzioni è descritto nel file di configurazione della versione 2.5 di squiddi cui puoi trovare una copia in /usr/share/doc/squid/examples/squid.conf
vi: Chỉ thị «http_anonymizer» (làm cho vô danh http) có trong squid phiên bản 2.1 và 2.2 không còn tồn tại lại trong squid phiên bản 2.3 và sau. Nó đã được thay thế bằng «header_replace» (thay thế phần đầu) và «header_access» (truy cập phần đầu) mà cung cấp khả năng điều khiển phần đầu HTTP một cách chính xác hơn. Lúc bây giờ, trình squid của bạn không còn làm cho vô danh lại phần đầu HTTP, thì bạn sẽ muốn sửa. Khuôn dạng mới được diễn tả trong tập tin cấu hình 2.5 mới: nên có một bản sao trong «/usr/share/doc/squid/examples/squid.conf».

source: The anonymize_headers and fake_user_agent directives have been replaced with header_access and header_replace.
vi: Hai chỉ thị «anonymize_headers» và «fake_user_agent» đã được thay thế bằng «header_access» và «header_replace».

source: The anonymize_headers and fake_user_agent directives that were present in squid 2.3 and 2.4 don't exist anymore in squid 2.5 and up. They have been replaced with header_replace and header_access that provide more fine-grained control over HTTP headers. Right now, your squid doesn't anonymize the HTTP headers anymore so you probably want to fix this. The new format is explained in the new 2.5 config file, of which you probably have a copy in /usr/share/doc/squid/examples/squid.conf.
vi: Hai chỉ thị «anonymize_headers» (làm cho vô danh phần đầu) và «fake_user_agent» (tác nhân người dùng giả) có trong squid phiên bản 2.3 và 2.4 không còn tồn tại lại trong squid phiên bản 2.5 và sau. Nó đã được thay thế bằng «header_replace» (thay thế phần đầu) và «header_access» (truy cập phần đầu) mà cung cấp khả năng điều khiển phần đầu HTTP một cách chính xác hơn. Lúc bây giờ, trình squid của bạn không còn làm cho vô danh lại phần đầu HTTP, thì bạn sẽ muốn sửa. Khuôn dạng mới được diễn tả trong tập tin cấu hình 2.5 mới: nên có một bản sao trong «/usr/share/doc/squid/examples/squid.conf».

source: There is no automatic upgrade path to squid 2.5.
vi: Không có đường dẫn tự động nâng cấp nào đến squid phiên bản 2.5.

source: SQUID 2.5 INSTALLATION WARNING
it: ATTENZIONE: INSTALLAZIONE DI SQUID 2.5
vi: CẢNH BÁO CÀI ĐẶT SQUID 2.5

source: You are upgrading squid from an 1.x version to the 2.5 version. The 1.x and 2.5 versions are NOT compatible. The structure of the cache directory is different and the configuration file "squid.conf" is not entirely compatible.
it: Stai effettuando l'aggiornamento di squid dalla versione 1.x alla versione2.5. Le versioni 1.x e 2.5 non sono compatibili. La struttura delle directorydi cache è stata cambiata e il file di configurazione "squid.conf" non èinteramente compatibile.
vi: Lúc này bạn đang nâng cấp trình squid từ phiên bản 1.x đến 2.5. Hai phiên bản này KHÔNG tương thích với nhau. Cấu trúc của thư mục nhớ tạm là khác nhau, và tập tin cấu hình «squid.conf» không tương thích hoàn toàn.

source: If you have an old cache directory, please quit NOW and remove the old cache by hand (in /var/spool/squid). Then re-install this squid version.
it: Se hai una directory di cache nel vecchio formato, per favore esci ORA erimuovi la vecchia directory manualmente (in /var/spool/squid). In seguitoripeti l'installazione di questa versione di squid.
vi: Nếu bạn có một thư mục nhớ tạm cũ, hãy thoát BÂY GIỜ và tự loại bỏ nó (ra «/var/spool/squid»). Sau đó thì hãy cài đặt lại phiên bản squid này.

source: Also, please accept the new configuration file. After upgrading your old configuration file can be found in "/etc/squid.conf.dpkg-old". Then you have to edit the new configuration file by hand to match your old configuration.
it: Inoltre, per favore, installa il nuovo file di configurazione. Al terminedell'aggiornamento puoi trovare il tuo vecchio file di configurazione in"/etc/squid.conf.dpkg-old". Dovrai modificare manualmente il nuovo file diconfigurazione per ottenere la tua vecchia configurazione.
vi: Hơn nữa, hãy chấp nhận tập tin cấu hình mới. Sau khi nâng cấp, có thể tìm tập tin cấu hình cũ trong «/etc/squid.conf.dpkg-old». Bạn cần phải tự sửa đổi tập tin cấu hình mới để khớp với cấu hình cũ ấy.

source: Do you want to quit now?
it: Vuoi uscire ora?
vi: Bạn có muốn thoát ngây bây giờ không?

source: squid-cgi now uses config file for target ACL
it: Ora squid-cgi usa un file di configurazione per le ACL
vi: squid-cgi lúc bây giờ dùng tập tin cấu hình cho ACL đích

source: squid-cgi now checks a configuration file before connecting to the target host. Only allowed target will be contacted. Please add hosts you want to access to the file /etc/squid/cachemgr.conf, one per line in the form
it: Da ora squid-cgi controlla un file di configurazione prima di connettersial server di destinazione. Solo le destinazioni autorizzate sarannocontattate. Per favore aggiungi i nomi dei server a cui vuoi accedere alfile /etc/squid/cachemgr.conf, uno per line, nella forma
vi: squid-cgi lúc bây giờ kiểm tra một tập tin cấu hình trước khi kết nối đến máy đích. Nó sẽ liên lạc với chỉ những đích được phép thôi. Bạn hãy thêm các máy bạn muốn truy cập vào tập tin «/etc/squid/cachemgr.conf», chỉ một máy trên mỗi dòng trong đơn.

source: hostname:port
it: nomehost:porta
vi: tên_máy:cổng

source: Upgrade squid.conf automatically?
it: Aggiornare squid.conf automaticamente?
vi: Tự động nâng cấp «squid.conf» không?

source: Incompatible settings have been found in the existing squid.conf file; they will prevent squid from starting or working correctly. However, this setup can try to modify them to work again. Do you want to apply the changes?
it: Sono state trovate impostazioni non compatibili nel file squid.conf esistente;tali opzioni inpediscono a squid di avviarsi o funzionare correttamente.Questo processo, comunque, può provare a modificarle per rendere squidnuovamente funzionante. Vuoi applicare le modifiche?
vi: Đã tìm thiết lập không tương thích trong tập tin «squid.conf» đã có: chúng sẽ ngăn cản squid khởi chạy hay hoạt động cho đúng. Tuy nhiên, trình này có thể cố sửa. Bạn có muốn áp dụng các thay đổi cần thiết không?

source: The authenticate_program directive has been replaced with auth_param.
vi: Chỉ thị «authenticate_program» đã được thay thế bằng «auth_param».

source: The authenticate_program directive that was present in squid <= 2.4 doesn't exist anymore in squid 2.5 and up. All authentication directives have been replaced with auth_param. Right now, your squid doesn't authenticate users anymore so you probably want to fix this. The new format is explained in the new 2.5 config file, of which you probably have a copy in /usr/share/doc/squid/examples/squid.conf.
it: L'opzione authenticate_program che era presente nelle versioni di squidprecedenti alla 2.4 non esiste più nelle versioni 2.5 e successive. Tutte leopzioni di autenticazione sono state sostituite con auth_param. In questomomento squid non è in grado di autenticare gli utenti; è probabile quindi chevorrai correggere questo problema. Il formato delle nuove opzioni è descrittonel file di configurazione della versione 2.5 di squid di cui puoi trovareuna copia in /usr/share/doc/squid/examples/squid.conf
vi: Chỉ thị «authenticate_program» (xác thực chương trình) có trong squid phiên bản ≤ 2.4 không còn tồn tại lại trong squid phiên bản 2.5 và sau. Mọi chỉ thị xác thực đã được thay thế bằng «auth_param» (tham số xác thực). Lúc bây giờ, trình squid của bạn không còn xác thực lại người dùng, thì bạn sẽ muốn sửa. Khuôn dạng mới được diễn tả trong tập tin cấu hình 2.5 mới: nên có một bản sao trong «/usr/share/doc/squid/examples/squid.conf».

source: Warning: squid may crash when logfiles size is bigger than 2GB.
vi: Cảnh báo: trình squid có thể bẻ khóa khi tập tin bản ghi có kích thước hơn 2GB.

source: Squid may crash if any of the logfiles grows bigger than 2GB. Please configure /etc/logrotate.d/squid accordingly to your site's traffic.
it: Squid può smettere di funzionare se la dimensione di uno qualsiasi dei filedi log cresce oltre i 2GB. Per favore configura /etc/logrotate/squid inmaniera consona al traffico sul tuo server
vi: Trình squid có thể bẻ khóa nếu tập tin bản ghi nào trở thành lớn hơn 2GB. Bạn hãy cấu hình «/etc/logrotate.d/squid» một cách thích hợp với tải nơi bạn.

source: Fix permissions of cache_dir?
it: Correggo i permessi della cache_dir?
vi: Sửa quyền hạn của «cache_dir» không?

source: Values for cache_effective_user and/or cache_effective_group in config file are incompatible with owner/group of cache directories. Do you want to automatically fix permissions on cache directory?
it: Il valore delle opzioni cache_effective_user e/o cache_effective_group nelfile di configurazione è incompatibile con il proprietario/gruppo delledirectory di cache. Vuoi correggere automaticamente i permessi sulla directorydi cache?
vi: Giá trị cho «cache_effective_user» (người dùng có quyền truy cập bộ nhớ tạm) và/hay «cache_effective_group» (nhóm như thế) trong tập tin cấu hình không có tương thích với người sở hữu/nhóm của thư mục nhớ tạm. Bạn có muốn tự động sửa quyền truy cập thư mục nhớ tạm không?

source: WARNING: If you specified a cache directory different from /var/spool/squid and selected some other directory used by other programs (e.g. /tmp), this could affect those programs.
it: ATTENZIONE: Se hai impostato come directory di cache una directory diversa da/var/spool/squid e questa directory è usata da altri programmi (per esempio/tmp), questa correzione potrebbe impedire a quei programmi di funzionarecorrettamente.
vi: CẢNH BÁO: nếu bạn đã ghi rõ một thư mục nhớ tạm khác với «/var/spool/squid», và đã chọn một thư mục khác mà chương trình khác có dùng (v.d. «/tmp»), thì thiết lập này có thể tác động lên những chương trình ấy.
