Repository: GICodeWarrior/mediawiki-extensions
Catalog: debs/viewvc/debian/po/*.po
Languages: cs, de, es, eu, fi, gl, ja, nl, pt, ro, sv

source: CVS roots:
cs: CVS kořeny:
de: CVS-Wurzelverzeichnisse:
es: Raíces CVS:
eu: CVS erroak:
fi: CVS-juuret:
gl: Raíces CVS:
ja: CVS ルートディレクトリ:
nl: CVS-hoofdmappen:
pt: Raízes para o CVS:
ro: Rădăcinile CVS:
sv: CVS-rötter:

source: This setting specifies each of the CVS roots (repositories) on your system and assigns names to them. Each root should be given by a "name: path" value. Multiple roots should be separated by commas.
cs: Tímto zadáte všechny kořeny CVS úložišť na vašem systému a přiřadíte jim jména. Každý kořen musí mít podobu "jméno: cesta". Více kořenů můžete oddělit čárkami.
de: Diese Einstellung gibt jedes der CVS-Wurzelverzeichnisse (Depots) auf Ihrem System an und weist ihnen Namen zu. Jedes Wurzelverzeichnis sollte mit einem »Name: Pfad«-Wert angegeben werden. Mehrere Wurzelverzeichnisse sollten durch Kommata getrennt werden.
es: Este parámetro especifica cada una de las raíces (repositorios) CVS de su sistema y les asigna un nombre. Cada raíz ha de especificarse en la forma «nombre: ruta». Para separar varias raíces, utilice comas.
eu: Ezarpen honek zure sistemako CVS erro (biltegi) bakoitza zehaztu eta izen bat ezartzen die. Erro bakoitza "izena:bidea" balio batez eman behar da. Erro ezerdinak gako bidez bereizi behar dira.
fi: Tämä asetus määrittää kaikki järjestelmän CVS-juuret (versionhallintavarastot) ja nimeää ne. Kukin juuri pitää antaa muodossa ”nimi: polku”. Jos juuria on useampia kuin yksi, ne tulee erottaa pilkuilla.
gl: Esta configuración especifica as raíces CVS (repositorios) do seu sistema e asígnalles nomes. Cada raíz debe especificarse mediante un valor "nome: ruta". As distintas raíces deben separarse mediante comas.
ja: この設定で CVS ルートディレクトリ群 (リポジトリ) がそれぞれシステムのどこにあるのかを指定して名前を付けます。ルートディレクトリに対してそれぞれ "name: path" という値の指定が必要です。複数のルートディレクトリ群はコンマで区切る必要があります。
nl: Deze instelling beschrijft alle CVS-hoofdmappen (roots, repositories) op uw systeem en geeft ze een naam. Elke hoofdmap dient te worden opgeven als "naam: pad". Verschillende hoofdmappen dienen te worden gescheiden door komma's.
pt: Esta opção especifica cada uma das raízes CVS (repositório) no seu sistema e dá nomes a cada uma delas. A cada raiz deverá ser dado um valor "nome: caminho". Várias raízes devem ser separadas por vírgulas.
ro: Acestă opţiune precizează fiecare din rădăcinile CVS (depozitele) de pe sistemul dumneavoastră şi asociază nume fiecăreia dintre ele. Fiecare rădăcină trebuie precizată printr-o valoare „nume: cale”. Dacă sunt mai multe rădăcini, se vor separa prin virgule.
sv: Denna inställning anger varenda av de CVS-rötter (förråd) på ditt system och tilldelar namn till dem. Varje rot ska anges med ett "namn: sökväg"-värde. Flera rötter ska separeras med kommatecken.

source: SVN roots:
cs: SVN kořeny:
de: SVN-Wurzelverzeichnisse:
es: Raíces SVN:
eu: SVN erroak:
fi: SVN-juuret:
gl: Raices SVN:
ja: SVN ルートディレクトリ:
nl: SVN-hoofdmappen:
pt: raízes SVN:
ro: Rădăcinile SVN:
sv: SVN-rötter:

source: This setting specifies each of the Subversion roots (repositories) on your system and assigns names to them. Each root should be given by a "name: path" value. Multiple roots should be separated by commas.
cs: Tímto zadáte všechny kořeny Subversion úložišť na vašem systému a přiřadíte jim jména. Každý kořen musí mít podobu "jméno: cesta". Více kořenů můžete oddělit čárkami.
de: Diese Einstellung gibt jedes der Subversion-Wurzelverzeichnisse (Depots) auf Ihrem System an und weist ihnen Namen zu. Jedes Wurzelverzeichnis sollte mit einem »Name: Pfad«-Wert angegeben werden. Mehrere Wurzelverzeichnisse sollten durch Kommata getrennt werden.
es: Este parámetro especifica cada una de las raíces (repositorios) Subversion de su sistema y les asigna un nombre. Cada raíz ha de especificarse en la forma «nombre: ruta». Para separar varias raíces, utilice comas.
eu: Ezarpen honek zure sistemako subversion erro (biltegi) bakoitza zehaztu eta izen bat ezartzen die. Erro bakoitza "izena:bidea" balio batez eman behar da. Erro ezerdinak gako bidez bereizi behar dira.
fi: Tämä asetus määrittää kaikki järjestelmän Subversion-juuret (versionhallintavarastot) ja nimeää ne. Kukin juuri pitää antaa muodossa ”nimi: polku”. Jos juuria on useampia kuin yksi, ne tulee erottaa pilkuilla.
gl: Esta configuración especifica as raíces Subversion (repositorios) do seu sistema e asígnalles nomes. Cada raíz debe especificarse mediante un valor "nome: ruta". As distintas raíces deben separarse mediante comas.<
ja: この設定で Subversion ルートディレクトリ (リポジトリ) がそれぞれシステムのどこにあるのかを指定して名前を付けます。ルートディレクトリに対してそれぞれ "name: path" という値の指定が必要です。複数のルートディレクトリ群はコンマで区切る必要があります。
nl: Deze instelling beschrijft alle Subversion-hoofdmappen (roots, repositories) op uw systeem en geeft ze een naam. Elke hoofdmap dient te worden opgeven als "naam: pad". Verschillende hoofdmappen dienen te worden gescheiden door komma's.
pt: Esta opção especifica cada uma das raízes do Subversion (repositórios) no seu sistema e dá nomes a cada uma delas. A cada raiz deverá ser dado um valor "nome: caminho". Várias raízes devem ser separadas por vírgulas.
ro: Acestă opţiune precizează fiecare din rădăcinile Subversion (depozitele) de pe sistemul dumneavoastră şi asociază nume fiecăreia dintre ele. Fiecare rădăcină trebuie precizată printr-o valoare „nume: cale”. Dacă sunt mai multe rădăcini, se vor separa prin virgule.
sv: Denna inställning anger varenda av de Subversion-rötter (förråd) på ditt system och tilldelar namn till dem. Varje rot ska anges med ett "namn: sökväg"-värde. Flera rötter ska separeras med kommatecken.

source: Default root:
cs: Výchozí kořen:
de: Standard-Wurzelverzeichnis:
es: Raíz por omisión:
eu: Lehenetsitako erroa:
fi: Oletusjuuri:
gl: Raíz por defecto
ja: 標準のルートディレクトリ:
nl: Standaard hoofdmap:
pt: Raiz por omissão:
ro: Rădăcina implicită:
sv: Standardrot:

source: Root to show if no root was chosen.
cs: Kořen, který se má zobrazovat v případě, že nebyl žádný vybrán.
de: Wurzelverzeichnis, das angezeigt werden soll, wenn keines ausgewählt wurde.
es: Raíz a mostrar en caso de no especificar ninguna.
eu: Errorik hautatzen ez denean erakutsi behar den erroa.
fi: Näytettävä juuri, jos juurea ei ole valittu.
gl: Raíz a amosar se non se escolle unha raíz.
ja: どのルートディレクトリも選ばれなかった際、表示するルートディレクトリ。
nl: Hoofdmap die gebruikt wordt als er geen geselecteerd is.
pt: Raízes a mostrar caso nenhuma raiz seja escolhida.
ro: Rădăcina afişată dacă nu a fost selectată nici o rădăcină.
sv: Rot att visa om ingen rot har valts.

source: <a href="mailto:admin@foo">Repository Admin</a>
cs: <a href="mailto:admin@foo">Správce repositáře</a>
de: <a href="mailto:admin@foo">Depot-Verwalter</a>
es: <a href="mailto:admin@foo">Administrador del repositorio</a>
eu: <a href="mailto:admin@foo">Biltegi kudeatzailea</a>
fi: <a href="mailto:admin@foo">Versionhallinnan ylläpitäjä</a>
gl: <a href="mailto:admin@foo">Administrador do repositorio</a>
ja: <a href="mailto:admin@foo">リポジトリ管理者</a>
nl: <a href="mailto:admin@foo">Repository-beheerder</a>
pt: <a href="mailto:admin@foo">Administrador de Repositório</a>
ro: <a href="mailto:admin@undeva">Administratorul depozitului</a>
sv: <a href="mailto:admin@foo">Förrådsadministratör</a>

source: Repository administrator address:
cs: Adresa správce repositáře:
de: Adresse des Depot-Verwalters:
es: Introduzca la dirección del administrador de los repositorios:
eu: Biltegi kudeatzailearen helbidea:
fi: Versionhallinnan ylläpitäjän osoite:
gl: Enderezo do administrador dos repositorios:
ja: リポジトリ管理者のメールアドレス:
nl: Geef het adres van de repository-beheerder:
pt: Endereço do administrador do repositório:
ro: Adresa administratorului depozitului:
sv: Adressen till förrådsadministratören:

source: This address is shown in the footer of the generated pages. It must be the address of the local repository maintainer (e.g. <a href="mailto:foo@bar">cvsadmin</a>).
cs: Tato adresa se zobrazuje v zápatí vygenerovaných stránek. Mělo by jít o adresu správce místního repositáře (např. <a href="mailto:karel@nekde">cvsadmin</a>).
de: Diese Adresse wird im Fuß der generierten Seiten angezeigt. Es muss die Adresse des lokalen Depot-Betreuers sein (z.B. <a href="mailto:foo@bar">CVS-Administrator</a>).
es: Esta dirección aparece en el pie de todas las páginas generadas. Debería apuntar a la dirección del responsable local del repositorio (p. ej.: <a href="mailto:tal@cual">Administrador local</a>.
eu: Helbide hau sortutako orrien oinean ikusiko da. Biltegi lokalaren kudeatzailean helbidea izan beharko zen (adib. <a href="mailto:foo@bar">cvskudeaketa</a>).
fi: Tämä sähköpostiosoite näytetään luotujen sivujen alatunnisteessa. Sen tulee olla paikallisen versionhallinnan ylläpitäjän osoite. (Esim. <a href="mailto:foo@bar">cvsadmin</a>).
gl: Este enderezo amósase no pé das páxinas xeradas. Debe ser o enderezo do mantedor dos repositorios locais (p.ex., <a href="mailto:foo@bar">cvsadmin</a>).
ja: このアドレスは生成されたページの下部に表示されます。これはローカルのリポジトリ管理者のアドレスである必要があります。 (例 <a href="mailto:foo@bar">cvsadmin</a>)
nl: Dit adres is te zien onderaan de gegenereerde pagina's. Het dient het adres te zijn van de lokale repositorybeheerder (bv: <a href="mailto:foo@bar">Repository-beheerder</a>).
pt: Este endereço é mostrado no rodapé das páginas geradas. Deverá ser o endereço do gestor local do repositório. (e.g. <a href="mailto:foo@bar">cvsadmin</a>)
ro: Această adresă este afişată în nota de subsol a paginilor generate. Trebuie să fie adresa responsabilului local al depozitului (ex. <a href="mailto:cineva@undeva">admincvs</a>).
sv: Denna adress är den som visas i sidfoten på de genererade sidorna. Den måste vara adressen till den lokala förrådsadministratören. (t.ex. <a href="mailto:foo@bar">cvsadmin</a>).

source: List of access-forbidden modules:
cs: Seznam modulů s omezeným přístupem:
de: Liste von zugangsverweigerten Modulen:
es: Lista de módulos de acceso prohibido:
eu: Sarrera debekatutako modulu zerrenda:
fi: Kiellettyjen moduulien lista:
gl: Lista de módulos con acceso prohibido:
ja: アクセスを許可しないモジュール:
nl: Lijst van modules waarvoor de toegang verboden is:
pt: Lista de módulos de proibição de acesso:
ro: Lista modulelor cu acces restricţionat:
sv: Lista över åtkomstförbjudna moduler:

source: This should contain a list of modules in the repository that should not be displayed (by default or by explicit path specification). This configuration can be a simple list of modules, or it can get quite complex: *) The "!" can be used before a module to explicitly state that it is NOT forbidden. *) Shell-style "glob" expressions may be used. "*" will match any sequence of zero or more characters, "?" will match any single character, "[seq]" will match any character in seq, and "[!seq]" will match any character not in seq.
cs: Nyní byste měli zadat seznam modulů v úložišti, které by se neměly zobrazovat (jak při běžném prohlížení, tak i při explicitním zadání cesty). Konfigurace může být jednoduchý výčet modulů, nebo také poměrně složité nastavení: *) "!" před jménem modulu explicitně říká, že NENÍ skrytý *) Také můžete použít běžné shellové zástupné znaky. "*" se shoduje s libovolnou sekvencí nula nebo více znaků, "?" se shoduje s jedním znakem, "[sekvence]" se shoduje s libovolným znakem ze sekvence a "[!sekvence]" se shoduje s libovolným znakem, který není obsažen v sekvenci.
de: Dies sollte eine Liste mit Modulen im Depot enthalten, die nicht angezeigt werden sollen (standardmäßig oder als explizite Pfadangabe). Diese Einstellung kann eine einfache Liste von Modulen sein oder komplizierter werden: *) Das »!« kann vor einem Modul benutzt werden, um explizit zu sagen, dass es NICHT verboten ist. *) Shell-artige Platzhalter-Ausdrücke können benutzt werden. »*« entspricht einer Folge von Null oder mehr Zeichen, »?« entspricht einem beliebigen Zeichen, »[seq]« entspricht jedem Zeichen in seq und »[!seq]« entspricht jedem Zeichen, das nicht in seq ist.
es: A continuación se pide la lista de los módulos del repositorios que no deberían mostrarse (ya sea por omisión o por indicar su ruta explícitamente). Tal lista puede ser simplemente una lista de módulos, o puede ser algo más complejo: *) El símbolo «!» puede usarse antes de un módulo para indicar explícitamente que NO está prohibido. *) Se pueden utilizar los comodines de tipo «shell»: por ejemplo, el símbolo «*» coincidirá con cualquier secuencia de cero o más caracteres, «?» coincidirá con un solo carácter, «[secuencia]» coincidirá con cualquier carácter incluido en dicha secuencia, y «[!secuencia]» coincidirá con cualquier carácter que no esté incluido en la secuencia.
eu: Honek erakutsi behar ez diren biltegiko modulu zerrenda eduki behar du (lehenespenez edo bide espezifikazio zehatzaz). Konfigurazio hau modulu zerrenda soil bat izan edo zerbait konplexuagoa izan daiteke: *) "!" ikurra erabili daiteke modulu batetan EZ-debekatua dela zehazteko. *) Shell-moduko "glob" espresioak erabili daitezke. "*"-ek 0 karaktere edo gehiago edozein sekuentzia parekatuko du, "?"-ek karakter soil bat, "[sek]"-ek sekuentzian edozein karaktere parekatuko du eta "[!sek]"-ek sekuentzian ez dagoen edozein karaktere.
fi: Tämän tulisi olla lista versionhallinnan moduuleista, joita ei näytetä (ei oletuksena eikä annettaessa polku eksplisiittisesti). Tämä asetus voi olla yksinkertainen lista moduuleista tai se voi olla monimutkainen: *) Merkki ”!” moduulin edessä tarkoittaa, että se EI ole kielletty. *) Komentotulkin ”glob”-tyylisiä lausekkeita voidaan käyttää. ”*” täsmää mihin tahansa nollan tai useamman merkin jonoon ja ”?” täsmää mihin tahansa yhteen merkkiin. ”[jono]” täsmää mihin tahansa jonon merkkiin ja ”[!jono]" täsmää mihin tahansa merkkiin joka ei ole jonossa.
gl: Isto debe conter unha lista de módulos do repositorio que non se deben amosar (nin por defecto nin especificando a súa ruta). Esta configuración pode consistir nunha simple lista de módulos ou pode complicarse máis: *) Pódese empregar "!" antes dun módulo para indicar que NON está prohibido. *) Pódense empregar comodíns coma os do intérprete de ordes. "*" encaixa con calquera secuencia de cero ou máis caracteres, "?" encaixa con calquera carácter, "[secuencia]" encaixa con calquera carácter da secuencia, e "[!sec]" encaixa con calquera carácter que non estea na secuencia.
ja: ここではリポジトリ内の表示させたくないモジュールのリストを設定してください (デフォルトのままか、もしくは明示的に path を指定します) 。この設定は単にモジュールを列挙してもかまいませんし、次のような複雑な指定をすることもできます: *) 明示的に「禁止ではない」という宣言を行うためには、モジュール名の前に "!" を使用できます。 *) シェル形式のグロブ表現も利用可能です。 "*" は0文字以上の文字列、 "?" は任意の 1 文字、"[seq]" は seq に含まれる任意の文字、そして "[!seq]" は seq に含まれない任意の文字にそれぞれマッチします。
nl: Dit dient een lijst van modules te bevatten die niet mogen worden weergegeven (zowel standaard als door middel van een expliciet opgegeven pad). De instelling kan een eenvoudige lijst van modules zijn of het kan behoorlijk ingewikkeld worden: *) Een "!" kan voor een module geplaatst worden om aan te geven dat de module expliciet NIET verboden is; *) Shell-achtige "glob" expressies mogen worden gebruikt. "*" komt overeen met een serie van nul of meer karakters, "?" met een enkel karakter, "[seq]" met een van de karakters in seq en "[!seq]" met een van de karakters niet in seq.
pt: Aqui deverá encontrar uma lista de módulos no repositório que não devem ser mostrados (por omissão ou por especificação explícita do caminho). Esta configuração pode ser uma simples lista de módulos, ou pode tornar-se bastante complexa: *) O "!" pode ser usado antes de um módulo para afirmar explicitamente que NÃO está proibido. *) Expressões do tipo shell "glob" pode ser utilizadas. "*" irá fazer coincidir qualquer sequência de zero ou mais caracteres, "?" irá fazer coincidir qualquer caracter,"[seq]" irá fazer coincidir qualquer caractere em seq, e "[!seq]" irá fazer coincidir qualquer caractere que não esteja em seq.
ro: Aici este precizează o listă cu module din depozit care nu ar trebui să afişate (implicit sau prin precizare explicită a căii). Acestă configuraţie poate fi o simplă listă de module sau poate fi chiar complexă: *) „!” poate fi folosit înaintea unui modul pentru a preciza explicit că accesul NU este restricţionat. *) Pot fi folosite expresiile de expandare în stil consolă. „*” se va potrivi de zero sau mai multe caractere, „?” se va potrivi cu un singur caracter, oricare ar fi acesta, „[secv]” se va potrivi cu orice caracter din secv şi „[!secv]” se va potrivi cu orice caracter care nu este în secv.
sv: Denna ska innehålla en lista över moduler i förrådet som inte ska visas (som standard eller genom uttrycklig specifikation av sökvägar). Denna konfiguration kan vara en enkel lista över moduler eller kan vara rätt så komplex: *) "!" kan användas före en modul för att uttryckligen säga att den INTE är förbjuden. *) Skal-liknande "glob"-uttryck kan användas. "*" matchar alla sekvenser av inga eller fler tecken, "?" kommer att matcha alla ensamma tecken, "[seq]" kommer att matcha vilket tecken som helst i seq och "[!seq]" matchar vilket tecken inte i seq.

source: Allow automatic tarball generation?
cs: Povolit automatické vytváření tar archivů?
de: Automatische Tar-Archiv-Erstellung erlauben?
es: ¿Permitir generación automática de archivos tar?
eu: Pakete (tarball) sortze automatikoa onartu?
fi: Sallitaanko automaattinen tar-pallojen luonti?
gl: ¿Permitir xerar arquivos tar automaticamente?
ja: tarball の自動生成を行いますか?
nl: Staat u het genereren van tar-ballen toe?
pt: Permitir a criação automática de arquivos tarball?
ro: Se permite generarea automată a arhivelor?
sv: Tillåt generering av tar-arkiv?

source: ViewVC can generate a tarball (.tar.gz) from a repository on the fly. This option allows (you/anyone) to download a tarball of the current directory.
cs: ViewVC umí za běhu vytvářet tar archivy repositářů. Touto volbou umožníte stahování tar archivu aktuálního adresáře.
de: ViewVC kann nebenbei ein Tar-Archiv (.tar.gz) von einem Depot erzeugen. Diese Option erlaubt es (Ihnen/jedem) ein Tar-Archiv des aktuellen Verzeichnisses herunterzuladen.
es: ViewVC puede generar un archivo tar (un .tar.gz, en realidad) de un repositorio en el momento. Esta opción le permite controlar si cualquiera que se conecte al repositorio puede descargar un archivo tar del directorio en el que se encuentre.
eu: ViewVC-ek pakete bat sortu dezake (.tar.gz) biltegi batetik zuzenean. Ezaugarri honek (zu/edozein) uneko direktorioaren pakete bat deskargatzeko aukera ematen dizu.
fi: ViewVC voi lennossa luoda tar-pallon (.tar.gz) versionhallinnan varastosta. Tämä asetus sallii kenen tahansa ladata hakemistojen sisällöt tar-palloina.
gl: ViewVC pode xerar un arquivo tar (.tar.gz) dun repositorio no momento. Esta opción permite que calquera descargue un arquivo tar do directorio actual.
ja: ViewVC はリポジトリから tarball (.tar.gz) を直接生成できます。このオプションは (誰でも) 現在のディレクトリから tarball をダウンロード可能にするものです。
nl: ViewVC kan op aanvraag van een bewaarplaats een tar-bal maken. Deze optie maakt het mogelijk om een tar-bal van de huidige map op te halen.
pt: O ViewCVS pode criar arquivos tarball (.tar.gz) de um repositório em qualquer altura. Esta opção permite (voçê/qualquer pessoa) fazer o download do arquivo tarball no actual directório.
ro: ViewVC poate genera o arhivă (.tar.gz) dintr-un depozit fără a provoca întreruperi. Această opţiune vă va permite (atât dumneavoastră cât şi oricui) să descarce o arhivă a directorului curent.
sv: ViewCVS kan generera ett tar-arkiv från ett förråd när det behövs. Detta alternativ tillåter (dig/någon annan) att hämta ner ett tar-arkiv av den aktuella katalogen.
