Repository: GICodeWarrior/mediawiki-extensions
Catalog: fundcore/modules/i18n/contrib/po/*.po
Languages: da

source: <h2>This module provides support for multilingual blocks</h2> <p>These are not real blocks, but metablocks that group together a number of normal blocks and display the right one depending on language</p> <p>In the block administration pages you will find a new tab for creating "Multilingual blocks". Set them up as usual (region, visibility, etc...) and then click on configuration, to define which one of the other blocks will be shown for each language.</p>
da: <h2>Dette module understøtter flersprogede blokke</h2> <p>Disse er ikke rigtige blokke men meta-blokke, der samler et antal normale blokke og viser den korrekte afhængigt af det aktive sprog</p> <p>Under blokadministrationen finder du et nyt faneblad til oprettelse af "Flersprogede blokke". Konfigurer dem som sædvanligt (region, synlighed, osv.) og klik derefter på indstillinger' for at bestemme hvilke andre blokke, der skal vises for hvert sprog.</p>

source: <p>These are not real blocks, but metablocks that group together a number of normal blocks and display the right one depending on language</p>
da: <p>Disse er ikke rigtige blokke men meta-blokke, der samler et antal normale blokke og viser den korrekte afhængigt af det aktive sprog</p>

source: Manages multilingual meta-blocks. <b>Requires i18n and locale module</b>
da: Håndterer flersproglige metablokke. <strong>Kræver modulerne i18n og locale</strong>

source: add multilingual block
da: tilføj flersproglig blok

source: Multilingual block %number
da: Flersproglig blok %number

source: Block description
da: Blokbeskrivelse

source: Select the block to be displayed for each language
da: Vælg hvilken blok der skal vises for hvert sprog

source: Multilingual block
da: Flersproglig blok

source: Save
da: Gem

source: The new multilingual block has been created.
da: Flersproglig blok oprettet.

source: <p>This module provides support for translatable custom menu items:</p> <ul> <li>Create menus as usual, with names in English. If the menu is already created, no changes are needeed</li> <li>Show the menu in some block</li> <li>Switch language to some non english one -while viewing the block-, so the <i>locales</i> table is populated with the new strings</li> <li>Use the localization system to translate menu item strings</li> </ul>
da: <p>Dette modul giver mulighed for at oversætte menupunkter:</p> <ul> <li>Opret menuer som sædvanligt, med navne på Dansk. Hvis menuen allerede findes skal der ikke ændres noget</li> <li>Vis menuen i en blok</li> <li>Skift til et andet sprog end dansk mens blokken vises, så de nye strenge tilføjes til <em>locales</em>-tabellen</li> <li>Brug lokaliseringssystemet til at oversætte menupunkterne</li> </ul>

source: Supports translatable custom menu items. <b>Requires i18n and locale module</b>
da: Understøtter oversættelse af menupunkter. <strong>Kræver modulerne i18n og locale</strong>
