Repository: GICodeWarrior/mediawiki-extensions
Catalog: fundcore/po/*.po
Languages: ca, cs, da, de, hu, it, ja, nl, no, pl, pt, ro, ru, tr

source: Discloses fundraising data while preserving requested donor privacy.
ca: Informa sobre les donacions de fons, preservant la privadesa del donant.
cs: Zveřejňuje data o příspěvcích při zachování soukromí přispěvatelů.
da: Viser indsamlingsdata uden at kompromittere ønsket donoranonymitet.
de: Veröffentlichte Spendendaten unter Wahrung der vom Spender gewünschten Privatsphäre.
hu: Mutatja a gyűjtőkampány állását az adományozók személyiségi jogainak figyelembevételével.
it: Mostra i dati aggiornati sulla raccolta fondi senza violare la privacy dei donatori.
ja: 寄付のデータを公開します。希望がある場合は匿名としています。
nl: Geeft geldinzamelactiedata vrij met het behouden van de privacy zoals de donateur wenste.
no: Viser innsamlingsdata mens man beholder donorens ønske om anonymitet.
pl: Ukazuje dane dotyczące zbierania funduszy, a jednocześnie pozwala darczyńcom na zachowanie anonimowości.
ro: Afişare datele strângerii de fonduri, păstrând intimitatea donatorilor
ru: Отображает данные о пожертвованиях, сохраняя установленный уровень анонимности.
tr: Bağış yapanların gizliği korunurken, bağış verileri gösterilemktedir.

source: Fundraising C.O.R.E.
ca: Fundació C.O.R.E.
hu: Gyűjtőkampány Központi Internetes Jelentő Rendszer
it: Raccolta fondi - sistema C.O.R.E.
ja: 寄付状況オンラインレポート
nl: Giften C.O.R.E.
no: Innsamlingsaksjon C.O.R.E.
ro: Strângere de fonduri C.O.R.E.
ru: Сбор средств
tr: Bağış Kampanyası C.O.R.E.

source: Live contributions
ca: Donacions en directe
cs: Aktuální příspěvky
da: Live bidrag
de: Aktuelle Beiträge
hu: Élő adománykövetés
it: Risultati in diretta
ja: 寄付の状況
nl: Recente bijdragen
no: Bidrag i realtid
pl: Bieżące datki
pt: Contribuições ao vivo/em directo
ro: Contribuţii Live
ru: Вклады в реальном времени
tr: Katkılar (canlı)

source: Browse by date
ca: Navega per data
cs: Prohlížet dle data
da: Gennemse efter dato
de: Nach Datum sortiert durchsuchen
hu: Böngészés dátum szerint
it: Elenco cronologico
ja: 日付順の集計
nl: Bekijk op datum
no: Naviger etter dato
pl: Przeglądaj wg daty
pt: Navegar por data
ro: Afişare după dată
ru: Просмотр по дате
tr: Tarihe göre bak

source: Count
ca: Donatius
cs: Počet
da: Antal
de: Zähler
hu: Számláló
it: Numero
ja: 総寄付件数
nl: Aantal
no: Antall
pl: Ilość
pt: Conta
ro: Număr
ru: Количество
tr: Bağış sayısı

source: Minimum
ca: Mínim
it: Minima
ja: 最少額
pt: Mínimo
ro: Minim
ru: Минимум
tr: En az

source: Mean
ca: Mitjana
cs: Průměr
da: Betyder
de: Mittel
hu: Átlag
it: Media
ja: 平均
nl: Gemiddelde
no: Snitt
pl: Średnia
pt: Média
ro: Mediu
ru: Среднее
tr: Ortalama

source: Maximum
ca: Màxim
da: Maksimum
it: Massima
ja: 最多額
no: Maksimum
pl: Maksimum
pt: Máximo
ro: Maxim
ru: Максимум
tr: En fazla

source: Total
cs: Celkem
da: I alt
de: Gesamtsumme
hu: Összesen
it: Totale
ja: 総額
nl: Totaal
pl: Suma
ru: Итого
tr: Toplam

source: Standard Deviation
ca: Desviació estàndard
cs: Standardní odchylka
da: Standard Afvigelse
de: Standardabweichung
hu: Normál eltérés
it: Scarto quadratico medio
ja: 標準偏差
nl: Standaard Deviatie
no: Standardavvik
pl: Standardowa odchyłka
pt: Desvio padrão
ro: Deviaţie standard
ru: Стандартное отклонение
tr: Standart Sapma

source: Statistical breakdown (%currency)
ca: Estadístiques globals (%currency)
cs: Statistický souhrn (%currency)
da: Statistisk analyse (%currency)
de: Statistische Aufschlüsselung (%currency)
hu: Statisztikai elemzés (%currency)
it: Ripartizione statistica (%currency)
ja: %currencyの内訳
nl: Statistische opdeling (%currency)
no: Statistisk oversikt (%currency)
pl: Podział statystyczny (%currency)
pt: Análise estatística (%currency)
ro: Împărţire statistică (%currency)
ru: Статистический анализ (%currency)
tr: İstatiksel analiz (%currency)

source: Currency
ca: Moneda
cs: Měna
da: Valuta
de: Währung
hu: Pénznem
it: Valuta
ja: 通貨
nl: Munteenheid
no: Valuta
pl: Waluta
pt: Moeda
ro: Monedă
ru: Валюта
tr: Para birimi

source: Amount
ca: Quantitat
cs: Částka
da: Antal
de: Summe
hu: Mennyiség
it: Importo
ja: 総額
nl: Hoeveelheid
no: Sum
pl: Kwota
pt: Montante
ro: Valoare
ru: Сумма
tr: Miktar

source: Equivalent in %currency
ca: Equivalent en %currency
cs: Ekvivalent v %currency
da: Tilsvarende beløb i %currency
de: Entspricht in %currency
hu: Megfelelője %currency pénznemben
it: Equivalente in %currency
ja: %currencyでの相当額
nl: Waarde in %currency
no: Sum i %currency
pl: Ekwiwalent w %currency
pt: Equivalente em %currency
ro: Echivalent în %currency
ru: Эквивалент в %currency
tr: %currency karşılığı eşdeğeri

source: Breakdown by currency
ca: Estadístiques per divisa
cs: Souhrn dle měny
da: Analyse efter valuta
de: Nach Währung aufgeschlüsselt
hu: Pénznem szerinti felosztás
it: Ripartizione per valuta
ja: 通貨ごとの内訳
nl: Opdeling volgens munteenheid
no: Vis valuta for valuta
pl: Podział wg waluty
pt: Análise por moeda
ro: Afişare după monedă
ru: Анализ по валютам
tr: Para birimine göre analiz

source: Browsing contributions
ca: Navegant per donacions
cs: Prohlížení příspěvků
da: Gennemser bidrag
de: Beiträge durchsuchen
hu: Adományok böngészése
it: Elenco dei donatori
ja: 寄付の様子
nl: Raadpleeg bijdragen
no: Naviger etter bidrag
pl: Przeglądanie datków
pt: Navegar por contribuições
ro: Afişare contribuitori
ru: Просмотр вкладов
tr: Bağış analizleri

source: Browsing year %year
ca: Navegant per any %year
cs: Prohlížení roku %year
da: Gennemser år %year
de: Jahr %year durchsuchen
hu: %year. böngészése
it: Elenco per l'anno %year
ja: %year年で検索
nl: Raadpleeg jaar %year
no: Naviger etter år %year
pl: Przeglądanie roku %year
pt: Navegar por ano %year
ro: Afişare anul %year
ru: Просмотр %year года
tr: %year yılına bakılıyor

source: Browsing month %year-%month
ca: Navegant per mes %month/%year
cs: Prohlížení měsíce %year-%month
da: Gennemser måned %month-%year
de: Monat %year-%month durchsuchen
hu: %year. %month böngészése
it: Elenco per il mese %year-%month
ja: %year年%month月で検索
nl: Raadpleeg maand %year-%month
no: Naviger etter måned %year-%month
pl: Przeglądanie miesiąca %year-%month
pt: Navegar por mês %year-%month
ro: Afişare luna %year-%month
ru: Просмотр %month месяца %year года
tr: %year-%month ayına bakılıyor

source: Browsing day %year-%month-%day
ca: Navegant per dia %day/%month/%year
cs: Prohlížení dne %year-%month-%day
da: Gennemser dag %day-%month-%year
de: Tag %year-%month-%day durchsuchen
hu: %year. %month %day. böngészése
it: Elenco per il giorno %year-%month-%day
ja: %year年%month月%day日で検索
nl: Raadpleeg dag %year-%month-%day
no: Naviger etter dag %year-%month-%day
pl: Przeglądanie dnia %year-%month-%day
pt: Navegar por dia %year-%month-%day
ro: Afişare ziua %year-%month-%day
ru: Просмотр даты %day.%month.%year
tr: %year-%month-%day gününe bakılıyor

source: Year
ca: Any
cs: Rok
da: År
de: Jahr
hu: Év
it: Anno
ja: 年
nl: Jaar
no: År
pl: Rok
pt: Ano
ro: Anul
ru: Год
tr: Yıl

source: Month
ca: Mes
cs: Měsíc
da: Måned
de: Monat
hu: Hónap
it: Mese
ja: 月
nl: Maand
no: Måned
pl: Miesiąc
pt: Mês
ro: Luna
ru: Месяц
tr: Ay

source: Day
ca: Dia
cs: Den
da: Dag
de: Tag
hu: Nap
it: Giorno
ja: 日
nl: Dag
no: Dag
pl: Dzień
pt: Dia
ro: Ziua
ru: День
tr: Gün

source: Filter contribution results
ca: Filtra resultats de donació
cs: Hledat v příspěvcích
da: Filtrer bidragsresultater
de: Beiträge filtern
hu: Adományok szűrése
it: Filtra l'elenco dei donatori
ja: 寄付結果の検索
nl: Filter bijdragen
no: Filtrer bidragsresultater
pl: Filtruj dane dotyczące datków
pt: Filtrar resultados de contribuições
ro: Filtrare rezultate contribuţii
ru: Отфильтровать результаты
tr: Bağışları seçeneklere göre filtrele

source: On or after
ca: Després del
cs: Ode dne
da: På eller efter
de: Von (einschließlich)
hu: Ekkor, vagy később
it: A partire dal
ja: この日以後
nl: Vanaf
no: På eller etter
pl: w oraz po
pt: Em ou depois do dia
ro: La sau după
ru: После и включая
tr: Belirtilen günde ve sonrasında

source: On or before
ca: Abans del
cs: Po den
da: På eller før
de: Bis (einschließlich)
hu: Ekkor vagy korábban
it: Fino a tutto il
ja: この日まで
nl: Tot en met
no: På eller før
pl: w oraz przed
pt: Em ou antes do dia
ro: La sau înainte de
ru: До и включая
tr: Belirtilen günde ve öncesinde

source: Total in %currency
ca: Total en %currency
cs: Celkem v %currency
de: Gesamtsumme in %currency
hu: Összesen %currency pénznemben
it: Totale in %currency
ja: %currency 合計
no: Sum i %currency
pl: Suma w %currency
pt: Total em %currency
ro: Total în %currency
ru: Итог в %currency
tr: %currency cinsinden toplamı

source: Restrict to a specific currency
ca: Restringir-ho a una divisa
cs: Omezit na měnu
da: Begræns til en bestemt valuta
de: Gesamtsumme in %currency
hu: Szűkítése egy meghatározott pénznemre
it: Solo la valuta selezionata
ja: 特定通貨による寄付を検索する
nl: Alleen een bepaalde munteenheid
no: Begrens til en spesifikk valuta
pl: Ogranicz do określonej waluty
pt: Filtrar resultados de contribuições
ro: Restricţionare la o anumită monedă
ru: Только в валюте
tr: Belirlen para birimindeki bağışları göster

source: Only show contributions with comments
ca: Només donacions amb comentaris
cs: Ukázat pouze příspěvky s komentáři
da: Vis kun bidrag med kommentarer
de: Nur Beiträge mit Kommentaren anzeigen
hu: Csak a megjegyzéssel ellátott adományok mutatása
it: Mostra solo i donatori che hanno lasciato un commento
ja: コメントのある寄付のみを表示する
nl: Bekijk alleen bijdragen met commentaar
no: Vis bare bidrag med kommentarer
pl: Pokaż wyłącznie datki z komentarzem
pt: Mostrar apenas contribuições com comentários"
ro: Se afişează doar contribuţiile cu comentarii
ru: Показывать только вклады с комментариями
tr: Sadece açıklamaları olan bağışları göster

source: View results
ca: Mostra resultats
cs: Zobrazit výsledky
da: Vis resultater
de: Ergebnisse anzeigen
hu: Eredmények megtekintése
it: Vedi i risultati
ja: 結果を見る
nl: Bekijk resultaten
no: Vis resultater
pl: Pokaż wyniki
pt: Ver resultados
ro: Afişare rezultatele
ru: Просмотреть результаты
tr: Sonuçları göster

source: Anonymous
ca: Anònim
cs: Anonymní
da: Anonym
de: Anonym
hu: Névtelen
it: Anonimo
ja: 匿名
nl: Anoniem
no: Anonym
pl: Anonimowy
pt: Anônimo/Anónimo
ro: Anonim
ru: Инкогнито
tr: Anonim

source: Sorry, there are no matching contributions.
ca: Ho sentim, no hi ha donacions que coincideixin.
cs: Nenalezeny žádné příspěvky odpovídající kritériím.
da: Beklager, der er ingen sådanne bidrag.
de: Es gibt leider keine entsprechenden Beiträge.
hu: Sajnálom, nem találtam a feltételnek megfelelő adományt.
it: Spiacente, non ci sono donatori con i criteri selezionati.
ja: 検索条件に該当する寄付はありません。
nl: Sorry, er zijn geen overeenkomstige bijdragen.
no: Beklager, ingen bidrag passer med søket.
pl: Brak datków spełniających podane kryteria.
pt: Desculpe, não há nenhuma contribuição com os parâmetros especificados.
ro: Îmi pare rău, nu există contribuţii care să se potrivească.
ru: Извините, но поиск не дал результатов.
tr: Özür dileriz, kriterlere uyan katkı bulunamadı.

source: Name and Comment
ca: Nom i comentari
cs: Jméno a komentář
da: Navn og Kommentar
de: Name und Kommentar
hu: Név és megjegyzés
it: Nome e commento
ja: お名前とコメント
nl: Naam en Commentaar
no: Navn og kommentar
pl: Nazwa i komentarz
pt: Nome e Comentário
ro: Nume şi Comentariu
ru: Имя и комментарий
tr: İsim ve Açıklama

source: Time (%timezone)
ca: Hora (%timezone)
cs: Čas (%timezone)
da: Tid (%timezone)
de: Zeit (%timezone)
hu: Dátum (%timezone)
it: Data (%timezone)
ja: 時刻 (%timezone)
nl: Tijd (%timezone)
no: Tid (%timezone)
pl: Czas (%timezone)
pt: Hora (%timezone)
ro: Ora (%timezone)
ru: Время (%timezone)
tr: Tarih (%timezone)

source: Make a Donation
ca: Feu un donatiu
it: Fai una donazione
ja: 寄付する
no: Doner
pl: Przekaż datek
ru: Сделать вклад
