Repository: GICodeWarrior/mediawiki-extensions
Catalog: debs/mailman/debian/po/*.po
Languages: sv

source: ar (Arabic)
sv: ar (Arabiska)

source: ca (Catalan)
sv: ca (Katalanska)

source: cs (Czech)
sv: cs (Tjeckiska)

source: da (Danish)
sv: da (Danska)

source: de (German)
sv: de (Tyska)

source: en (English)
sv: en (Engelska)

source: es (Spanish)
sv: es (Spanska)

source: et (Estonian)
sv: et (Estniska)

source: eu (Basque)
sv: eu (Baskiska)

source: fi (Finnish)
sv: fi (Finska)

source: fr (French)
sv: fr (Franska)

source: hr (Croatian)
sv: hr (Kroatiska)

source: hu (Hungarian)
sv: hu (Ungerska)

source: it (Italian)
sv: it (Italienska)

source: ja (Japanese)
sv: ja (Japanska)

source: ko (Korean)
sv: ko (Koreanska)

source: lt (Lithuanian)
sv: lt (Litauiska)

source: nl (Dutch)
sv: nl (Nederländska)

source: no (Norwegian)
sv: no (Norska)

source: pl (Polish)
sv: pl (Polska)

source: pt (Portuguese)
sv: pt (Portugisiska)

source: pt_BR (Brasilian Portuguese)
sv: pt_BR (Brasiliansk portugisiska)

source: ro (Romanian)
sv: ro (Rumänska)

source: ru (Russian)
sv: ru (Ryska)

source: sl (Slovenian)
sv: sl (Slovenska)

source: sr (Serbian)
sv: sr (Serbiska)

source: sv (Swedish)
sv: sv (Svenska)

source: tr (Turkish)
sv: tr (Turkiska)

source: uk (Ukrainian)
sv: uk (Ukrainska)

source: vi (Vietnamese)
sv: vi (Vietnamesiska)

source: zh_CN (Chinese - China)
sv: zh_CN (Kinesiska - Kina)

source: zh_TW (Chinese - Taiwan)
sv: zh_TW (Kinesiska - Taiwan)

source: en (English)[ default language ]
sv: sv (Swedish)

source: Languages to support:
sv: Språk som stöds:

source: For each supported language, Mailman stores default language specific texts in /etc/mailman/LANG/ giving them conffile like treatment with the help of ucf. This means approximately 150kB for each supported language on the root file system.
sv: Mailman lagrar specifik text för standardspråket i /etc/mailman/LANG/ för varje språk som stöds och ger dem konfigurationsfilsliknande behandling med hjälp av ucf. Det här betyder att ungefär 150kB för varje språk som stöds används på rotfilsystemet.

source: If you need a different set of languages at a later time, just run dpkg-reconfigure mailman.
sv: Om du behöver en annan uppsättning språk vid en senare tidpunkt, kör "dpkg-reconfigure mailman".

source: NOTE: Languages enabled on existing mailing lists are forcibly re-enabled when deselected and mailman needs at least one language for displaying its messages.
sv: OBSERVERA: Aktiverade språk på existerande sändlistor kommer att tvingas att återaktiveras när de avmarkeras och mailman behöver åtminstone ett språk för att visa sina meddelanden.

source: Gate news to mail?
sv: Hantera nyhetsgrupper till sändlistor?

source: Mailman allows to gate news to mail, that is, send all the messages which appear in a Usenet newsgroup to a mailing list.
sv: Mailman tillåter att sända nyhetsgrupper till sändlistor, alltså, skicka alla meddelanden som dyker upp i en Usenet-nyhetsgrupp till en sändlista.

source: Most people won't need this.
sv: De flesta kommer inte att behöva detta.

source: Missing site list
sv: Saknad "site list"

source: Mailman needs a so-called "site list", which is the list from which password reminders and such are sent out from. This list needs to be created before mailman will start.
sv: Mailman behöver en så kallad "site list" som är en lista från vilka påminnelser om lösenord och liknande skickas ut från. Denna lista behöver skapas före mailman startar upp.

source: To create the list, run "newlist mailman" and follow the instructions on-screen. Note that you also need to start mailman after that, using /etc/init.d/mailman start.
sv: För att skapa listan, kör "newlist mailman" och följ instruktionerna på skärmen. Notera att du också behöver starta mailman efter det genom att köra "/etc/init.d/mailman start".

source: Default language for Mailman:
sv: Standardspråk för Mailman:

source: The web page will be shown in this language, and in general, Mailman will use this language to communicate with the user.
sv: Webbsidan kommer att visas på detta språk och i allmänhet kommer Mailman att använda detta språk för att kommunicera med användaren.

source: Old queue files present
sv: Gamla köfiler existerar

source: The directory /var/lib/mailman/qfiles contains files. It needs to be empty for the upgrade to work properly. You can try to handle them by: - Stop new messages from coming in (at the MTA level). - Start a mailman queue runner: /etc/init.d/mailman start - Let it run until all messages are handled. If they don't all get handled in a timely manner, look at the logs to try to understand why and solve the cause. - Stop it: /etc/init.d/mailman stop - Retry the upgrade. - Let messages come in again. You can also decide to simply remove the files, which will make Mailman forget about (and lose) the corresponding emails.
sv: Katalogen /var/lib/mailman/qfiles innehåller filer. Den behöver tömmas för att uppgraderingen ska fungera korrekt. Du kan försöka att hantera dem genom att: - Stoppa nya meddelanden från att komma in i kön (på MTA-nivå. - Starta en kökörare i Mailman: /etc/init.d/mailman start - Låt den kör tills alla meddelanden är hanterade. Om alla inte blir hanterade på ett korrekt sätt, se på loggarna för att försöka förstå varför och lösa problemet. - Stoppa den: /etc/init.d/mailman stop - Försök uppgradera igen. - Låt meddelanden komma in igen. Du kan också bestämma att helt enkelt ta bort filerna, vilken kommer att göra att Mailman glömmer (och förlorar) motsvarande e-post.

source: If these files correspond to shunted messages, you have to either delete them or unshunt them (with /var/lib/mailman/bin/unshunt). Shunted messages are messages on which Mailman has already abandoned any further processing because of an error condition, but that are kept for admin review. You can use /var/lib/mailman/bin/show_qfiles to examine the contents of the queues.
sv: Om dessa filer motsvarar de undanskyfflade meddelandena behöver du antingen ta bort dem eller skyffla tillbaka dem (med /var/lib/mailman/bin/unshunt). Undanskyfflade meddelanden är meddelanden som Mailman redan har övergivet all ytterligare behandling av på grund av en felsituation men som hålls kvar för granskning av administratören. Du kan använda /var/lib/mailman/bin/show_qfiles för att undersöka innehållet i köerna.
