Repository: GICodeWarrior/mediawiki-extensions
Catalog: fundcore/modules/forward/po/*.po
Languages: el, it

source: Enables users to forward pages to friends.
el: Επιτρέπει στους χρήστες να προωθούν σελίδες σε φίλους τους.
it: Abilita gli utenti a inoltrare via mail una pagina agli amici

source: forward this page
el: προωθήστε αυτή τη σελίδα
it: Inoltra questa pagina

source: Send an e-Postcard
el: Στείλτε μια κάρτα με e-mail
it: Invia una e-Postcard

source: forward tracking
el: προωθήσεις
it: Traking del forward

source: Administrative Options
el: Επιλογές διαχείρισης
it: Opzioni amministrazione

source: Use Node Type in Link
el: Να χρησιμοποιείται ο τύπος του κόμβου στην παραπομπή
it: Usa il tipo di node nel link

source: If checked, the link will read &quot;email this <em>nodetype</em>&quot;; if not, it will just read &quot;email this page&quot;
el: Αν το επιλέξετε, η παραπομπή θα λέει &quot;στείλτε το <em>τύπος κόμβου</em>&quot;, αλλιώς θα λέει απλώς &quot;στείλτε το με e-mail&quot; (πιο κατάλληλο για την Ελληνική γλώσσα).
it: Se selezionato, .il link legge &quot;email this <em>nodetype</em>&quot;;, altrimenti legge soltanto &quot;email this page&quot;

source: Show link on main page
el: Η παραπομπή να εμφανίζεται στην κεντρική σελίδα
it: Mostra il link nella pagina principale

source: If checked, the link will appear on your home page
el: Αν το επιλέξετε, η παραπομπή θα εμφανίζεται στην αρχική σελίδα του ιστοτόπου σας.
it: Se selezionato, il link appare nella home page

source: Form Type
el: Τύπος φόρμας
it: Tipo di Form

source: Select link for a forward this page link or form to use a collapsible forwarding form.
el: Επιλέξτε "παραπομπή" για να εμφανίζεται μια παραπομπή "'στείλτε το με e-mail", ή "φόρμα" για να χρησιμοποιείται πτυσσόμενη φόρμα για την προώθηαη.
it: Seleziona link per inviare il link questa pagina o form per usare un modulo espandibile di inoltro

source: Flood Control Limit
el: Όριο του ελέγχου υπερβολών
it: Limite del Controllo Flood

source: How many times a user can use the form in a one hour period. This will help prevent the forward module from being used for spamming.
el: Πόσες φορές μπορεί να χρησιμοποιήσει ένας χρήστης τη φόρμα μέσα σε περίοδο μίας ώρας. Αυτό βοηθά στην αποτροπή της χρήσης της μονάδας forward για αποστολή καταχρηστικών μηνυμάτων (spam).
it: Quanti inoltri un utente puo' inviare ogni ora? Questo blocco elimita lo spamming

source: Flood Control Error
el: Σφάλμα του ελέγχου καταχρήσεων
it: Errore del Controllo Flood

source: You can't send more than %number messages per hour. Please try again later.
el: Δεν επιτρέπεται να στέλνετε περισσότερα από %number μηνύματα ανά ώρα. Ξαναδοκιμάστε αργότερα.
it: E' stato raggiunto il limite massimo di inoltri. Prova pi tardi per inviarne altri. <br>Grazie <br>Continua comunque la navigazione sul nostro sito.

source: This text appears if a user exceeds the flood control limit. The value of the flood control limit setting will appear in place of %number in the message presented to users
el: Το κείμενο αυτό εμφανίζεται αν ο χρήστης ξεπεράσει το όριο του ελέγχου υπερβολών. Η τιμή που έχει δοθεί στις ρυθμίσεις του ελέγχου υπερβολών θα εμφανίζεται στη θέση του %number στο μήνυμα που παρουσιάζεται στο χρήστη.
it: Questo testo appare quando un utente supera il limite di inoltri (Controllo Flood). The value of the flood control limit setting will appear in place of %number in the message presented to users

source: Page Text Values
el: Ρυθμίσεις για το κείμενο της σελίδας

source: Forward Instructions
el: Οδηγίες προώθησης
it: Istruzioni di inoltro

source: Thank you for your interest in spreading the word on
el: Ευχαριστούμε για το ενδιαφέρον σας να διαδώσετε τα νέα μας. -
it: Grazie per l'interesse nel nostro sito

source: NOTE: We only request your email address so that the person you are recommending the page to knows that you wanted them to see it, and that it is not junk mail. We do not capture any email address.
el: ΣΗΜΕΙΩΣΗ: Ο μόνος λόγος που ζητάμε τη διεύθυνση e-mail σας είναι για να γνωρίζει το πρόσωπο που συνιστάτε τη σελίδα ότι εσείς κρίνατε ότι πρέπει να τη δει, και ότι το μήνυμα δεν είναι καταχρηστική διαφήμιση. Δεν κρατάμε αυτές τις διευθύνσεις e-mail.
it: NOTA: richiediamo il tuo indirizzo email soltanto per presentare al tuo amico la email con la pagina da presentare, e percio' non canceller' la mail che riceve da noi come spam. Gli indirizzi di posta elettronica qui inseriti non vengono conservati dal sistema

source: This message will be displayed above the form.
el: Το μήνυμα αυτό θα εμφανίζεται πάνω από τη φόρμα.
it: Questo messaggio viene mostrato sopra il form.

source: Thank You Message
el: Ευχαριστήριο μήνυμα
it: Grazie per il tuo messaggio

source: Thank you for your help in spreading the word about
el: Ευχαριστούμε που βοηθήσατε να διαδοθούν τα νέα μας. -
it: Grazie per aver segnalato ad un tua amico le pagine di

source: We appreciate your help.
el: Ευχαριστούμε για τη βοήθειά σας.
it: Apprezziamo il tuo interesse per il nostro sito

source: This message will be displayed after the user successfully submits the form.
el: Το μήνυμα αυτό θα εμφανίζεται αφού ο χρήστης υποβάλει με επιτυχία τη φόρμα.
it: Questo messaggio viene esposto alla conferma dell'invio della mail

source: Forward Form Default Values
el: Προεπιλεγμένες ρυθμίσεις για τη φόρμα προώθησης
it: Valori di default dell'invio

source: From Address
el: Διεύθυνση αποστολέα
it: Indirizzo DA

source: The address to send from. Should be a functioning email address.
el: Η διεύθυνση του αποστολέα. Πρέπει να είναι μια έγκυρη διεύθυνση e-mail.
it: L'indirizzo da cui inviare. Dove essere un account email attivo

source: Header Image for Email
el: Εικόνα κεφαλίδας του e-mail
it: Immagine di intestaazione della mail

source: Enter the URL of the image to as a logo at the top of forwarded pages.
el: Ορίστε τη διεύθυνση URL της εικόνας που θα τοποθετείται ως λογότυπο στην κορυφή των σελίδων που προωθούνται.
it: Inserisci l'URL della immagine come logo in alto delle pagine inviate

source: Forward Message Subject
el: Θέμα μηνύματος προώθησης
it: Oggetto del messaggio

source: %name has forwarded a page to you from %site
el: Ο/Η %name σάς προώθησε μια σελίδα από τον ιστότοπο %site
it: Il tuo amico %name ti segnala questa pagina dal sito %site

source: Email subject line. The sender's name will appear in place of %name in the subject. The web site name will be inserted in place of %site
el: Η γραμμή θέματος του e-mail. Το όνομα του αποστολέα θα εμφανίζεται στο θέμα στη θέση του %name. Το όνομα του ιστοτόπου θα εισάγεται στη θέση του %site.
it: Oggetto Email.. Il mittente appare al posto di %name. nell'oggetto.Il nome del sito viene inserito al posto di %site.

source: Forward Message Body
el: Περιεχόμενο μηνύματος προώθησης
it: Testo del Messaggio

source: %name thought you would like to see this page from the %site web site.
el: Ο/Η %name πιστεύει ότι θα σας ενδιέφερε να δείτε αυτή τη σελίδα από τον ιστότοπο %site.
it: %name ha pensato che ti possa interessare questa pagina del sito %site.

source: Email message body. The sender's name will appear in place of %name in the message body. The web site name will be inserted in place of %site The sender will be able to add their own message after this.
el: Το περιεχόμενο του μηνύματος e-mail. Το όνομα του αποστολέα θα εμφανίζεται στο περιεχόμενο του μηνύματος στη θέση του %name. Το όνομα του ιστοτόπου θα εισάγεται στη θέση του %site. Ο αποστολέας θα μπορεί να προσθέσει το δικό του μήνυμα μετά από αυτό.
it: Testo del mesaggio email. Il mittente appare al posto di %name.Il nome del sito inserito al posto di %site. Il mittente puo' aggiungere il proprio testo dopo questo messaggio

source: e-Postcard Message Subject
el: Θέμα μηνύματος e-mail κάρτας
it: oggetto del messaggio e-Postcard

source: %name has sent you an e-postcard from %site
el: Ο/Η %name σάς έστειλε μια κάρτα με e-mail από τον ιστότοπο %site
it: %name ti ha inviato una e-postcard da %site

source: Postcard subject line. The sender's name will appear in place of %name in the subject. The web site name will be inserted in place of %site
el: Γραμμή θέματος e-mail κάρτας. Το όνομα του αποστολέα θα εμφανίζεται στο θέμα στη θέση του %name. Το όνομα του ιστοτόπου θα εισάγεται στη θέση του %site.

source: e-Postcard Message Body
el: Περιεχόμενο μηνύματος e-mail κάρτας

source: %name has sent you an e-postcard from the %site web site. Please take a moment to visit our web site.
el: Ο/Η %name σάς έστειλε μια κάρτα με e-mail από τον ιστότοπό %site. Αφιερώστε λίγα λεπτά για να επισκεφθείτε τον ιστότοπό μας.

source: Postcard message body. The sender's name will appear in place of %name in the message body. The web site name will be inserted in place of %site The sender will be able to add their own message after this.
el: Περιεχόμενο e-mail κάρτας. Το όνομα του αποστολέα θα εμφανίζεται στο περιεχόμενο του μηνύματος στη θέση του %name. Το όνομα του ιστοτόπου θα εισάγεται στη θέση του %site. Ο αποστολέας θα μπορεί να προσθέσει το δικό του μήνυμα μετά από αυτό.

source: Oranization Ad
el: Διαφημιστικό μήνυμα
it: Organization Ad

source: This message will be just above the footer message in the email.
el: Το μήνυμα αυτό θα εμφανίζεται ακριβώς πάνω από το μήνυμα του υποσέλιδου στο e-mail.
it: Questo messaggio appare sopra il messaggio a fine Email di inoltro.

source: Footer Message
el: Μήνυμα υποσέλιδου
it: Messaggio a fine Email di inoltro

source: This message will be postpended as a footer message to the email.
el: Το μήνυμα αυτό θα προσαρτάται στο τέλος του e-mail ως μήνυμα υποσέλιδου.
it: Questo messaggio viene accodato come messaggio a fine Email di inoltro.

source: Latest Blog Articles
el: Τελευταία δημοσιεύματα ιστολογίου
it: Ultimi Blog

source: Latest Users
el: Τελευταίοι χρήστες
it: Ultimi utenti

source: Latest Comments
el: Τελευταία σχόλια
it: ultimi commenti

source: Most Popular Content
el: Τα πιο δημοφιλή
it: Contenuti piu' popolari

source: None
el: Τίποτα
it: Nessuno

source: Dynamic Block
el: Δυναμικό μπλοκ
it: Block dinamici

source: Choose the dynamic block to send with these emails
el: Διαλέξτε το δυναμικό μπλοκ που θα στέλνεται με αυτά τα e-mail.
it: Scegli il blocco dinamico da inviare insieme alla mail di inoltro

source: Message to Send
el: Το μήνυμα που θα στείλετε
it: messaggio da inviare

source: Your Email
el: Το e-mail σας
it: La tua email

source: Your Name
el: Το όνομά σας
it: Il tuo nome

source: Send To
el: Να σταλεί στους
it: Invia a

source: Enter multiple addresses on separate lines or separate them with commas.
el: Για να δώσετε πολλές διευθύνσεις, τοποθετήστε τις σε ξεχωριστές γραμμές ή διαχωρίστε τις με κόμματα
it: Puoi inviare il messaggio a diversi tuoi amici. Usa la virgola per separare un indirizzo email dall'altro

source: Page Being Sent
el: Η σελίδα που στέλνετε
it: Pagina da inviare

source: Message Subject
el: Θέμα του μηνύματος
it: Testo

source: (Your Name)
el: (το όνομά σας)
it: (Il tuo nome)

source: Message Body
el: Περιεχόμενο του μηνύματος
it: Messaggio

source: Your Personal Message
el: Το προσωπικό σας μήνυμα
it: Il tuo messaggio personale

source: Send Message
el: Αποστολή μηνύματος
it: Invia messaggio

source: Forward this page to a friend
el: Προωθήστε αυτή τη σελίδα σε ένα φίλο
it: Inoltra questa pagina ad un amico

source: Header injection attempt detected. Do not enter line feed characters into the from field!
el: Το σύστημα ανίχνευσε απόπειρα έγχυσης σε κεφαλίδα (header injection). Μην εισάγετε χαρακτήρες αλλαγής γραμμής στο πεδίο του αποστολέα!

source: Your Email address is invalid.
el: Η διεύθυνση e-mail σας δεν είναι έγκυρη.
it: Inserisci il tuo indirizzo email (verifica di aver digitato correttamente)

source: You must enter your name.
el: Πρέπει να δώσετε το όνομά σας.
it: Inserisci il tuo nome

source: You did not enter any recipients.
el: Δεν ορίσατε κανέναν παραλήπτη.
it: Inserisci un destinatario

source: One of your Recipient addresses is invalid:
el: Μϊα από τις διευθύνσεις παραληπτών δεν είναι έγκυρη:
it: Gli indirizzi email di uno o piu' destinatari non sono formalmente corretti:

source: You must enter a message.
el: Πρέπει να δώσετε ένα μήνυμα.
it: Inserisci un messaggio

source: Recent blog posts
el: Τελευταία ιστολογήματα
it: Blogs recenti

source: Who's new
el: Ποιοι γράφτηκαν τελευταία
it: Chi e' nuovo?

source: Recent comments
el: Πρόσφατα σχόλια
it: Commenti recenti

source: email this page
el: στείλτε το με e-mail
it: invia questa pagina ad un amico

source: email this %type
el: στείλτε το με e-mail
it: Segnala ad un amico

source: Time
el: Χρόνος
it: Data

source: Type
el: Τύπος
it: Tipo

source: Path
el: Διαδρομή
it: Percorso

source: Title
el: Τίτλος
it: Titolo

source: emails sent to
el: e-mail σταλθηκαν σε
it: email inviate a

source: recipients
el: παραλήπτες
it: destinatari

source: No one has used Forward yet.
el: Κανένας δεν έχει χρησιμοποιήσει ακόμα την προώθηση.
it: Nessuno ha usato l'inoltro

source: Forward Tracking
el: Παρακολούθηση προωθήσεων
it: Tracking dell'inoltro

source: Most Emailed
el: Στάλθηκαν περισσότερο
it: I piu' inoltrati

source: Most Emailed Today
el: Στάλθηκαν περισσότερο σήμερα
it: I piu' inoltrati di oggi

source: Most Emailed This Week
el: Στάλθηκαν περισσότερο αυτή την εβδομάδα
it: I piu' inoltrati della settimana

source: Most Emailed of All Time
el: Στάλθηκαν περισσότερο, από πάντα
it: I piu' inotrati

source: Most Recently Emailed
el: Στάλθηκαν πιο πρόσφατα
it: Inoltri recenti

source: Block Type
el: Τύπος μπλοκ
it: Tipo di block

source: Choose the block type
el: Διαλέξτε τον τύπο του μπλοκ
it: Scegli il tipo di block

source: Today's Most Emailed
el: Σημερινά που στάλθηκαν περισσότερο
it: I piu' inotrati di oggi

source: This Week's Most Emailed
el: Αυτής της εβδομάδας που στάλθηκαν περισσότερο
it: Il piu' inoltrato della settimana

source: Forward module installed tables successfully.
el: Η μονάδα forward εγκατέστησε τους πίνακές της με επιτυχία.
it: Le tabelle del modulo forward sono state installate correttamente

source: The installation of forward module was unsuccessful.
el: Η εγκατάσταση της μονάδας forward απέτυχε.
it: Errore nella installazione del modulo forward

source: access forward
el: πρόσβαση σε προώθηση
it: accedi inoltro

source: administer forward
el: διαχείριση προώθησης
it: amministra inoltro

source: forward
el: προώθηση
it: inoltra

source: Message from Sender
el: Μήνυμα από τον αποστολέα
it: Messaggio dal mittente

source: Click here to read more on our site
el: Πατήστε εδώ για να διαβάσετε τη συνέχεια στον ιστότοπό μας
it: Click qui per maggiori info sul nostro sito

source: Click here to visit our site
el: Πατήστε εδώ για να επισκεφθείτε τον ιστότοπό μας
it: Click qui per vedere il nostro sito
